app/controllers/cadrelatorios_controller.rb

SELECT `cadrelatorios`.* FROM `cadrelatorios`
---
  def index

    @search = params[:search] || session[:search_relatorios]
    session[:search_relatorios] = @search
    begin
      if @search.blank?
          @cadrelatorios = Cadrelatorio.paginate(:page => params[:page])

SELECT `cadrelatorios`.* FROM `cadrelatorios` WHERE `cadrelatorios`.`id` = 5 LIMIT 1
---
  def show
    @cadrelatorio = Cadrelatorio.find(params[:id])

SELECT `cadrelatorios`.* FROM `cadrelatorios` WHERE `cadrelatorios`.`id` = 5 LIMIT 1
---
  def edit
    carrega_agregadas
    @cadrelatorio = Cadrelatorio.find(params[:id])

INSERT INTO `cadrelatorios` (`consulta`, `created_at`, `nome`, `updated_at`) VALUES ('select \r\n 	cis.chave as CI, \r\n 	cis.owner as Email, \r\n 	cis.descricao as Descricao, \r\n 	MAX(IF(atributos.dicdado_id = 16 , atributos.valor, NULL)) as CC ,\r\n 	MAX(IF(atributos.dicdado_id = 26 , atributos.valor, NULL)) as SO \r\n from \r\n cis, \r\n atributos, \r\n sites, \r\n tipocis \r\n where \r\n cis.tipoci_id=32 and \r\n atributos.ci_id = cis.id and \r\n cis.site_id = sites.id and \r\n cis.tipoci_id = tipocis.id \r\n group by \r\n cis.chave \r\n order by \r\n cis.chave;', '2013-06-13 23:13:09', 'ServServicos', '2013-06-13 23:13:09')
---
  def create
    @cadrelatorio = Cadrelatorio.new(params[:cadrelatorio])

    respond_to do |format|
      if @cadrelatorio.save

SELECT `cadrelatorios`.* FROM `cadrelatorios` WHERE `cadrelatorios`.`id` = 1 LIMIT 1
UPDATE `cadrelatorios` SET `consulta` = 'select \r\n cis.chave as CI, \r\n tipocis.tipo,cis.descricao as Descricao,\r\n sites.nome as Site, \r\n atributos.valor as IP from cis, \r\natributos,sites,tipocis where (atributos.dicdado_id = 6 or atributos.dicdado_id=10) and atributos.ci_id = cis.id and cis.site_id = sites.id and cis.tipoci_id = tipocis.id order by atributos.valor;', `updated_at` = '2013-10-21 18:42:37' WHERE `cadrelatorios`.`id` = 1
---
  def update
    @cadrelatorio = Cadrelatorio.find(params[:id])

    respond_to do |format|
      if @cadrelatorio.update_attributes(params[:cadrelatorio])