app/controllers/cis_controller.rb

  def show
    @ci, @atributos = Ci.find_com_atributos(params[:id])
---
SELECT `atributos`.* FROM `atributos` WHERE `atributos`.`ci_id` IN (30)

  def edit
    # @ci sendo carregado no filtro..
    @ci, @atributos = Ci.find_com_atributos(params[:id])
    if ! finalAuth[:edit].include? (@ci.tipoci_id)
      flash[:error] = "Voce nao tem autorizacao para editar CI do tipo #{@ci.tipoci.tipo}"
      render :show

    end
    carrega_agregadas
    begin
      @st = JSON.parse(Parametro.get({:tipo => "CI", :subtipo => "FiltroStatus"})).select { |x| x[0] == @ci.tipoci.tipo }[0][1]
---
SELECT `atributos`.* FROM `atributos` WHERE `atributos`.`ci_id` IN (119)
SELECT `tipocis`.* FROM `tipocis` ORDER BY tipo ASC
SELECT `tipocis`.* FROM `tipocis` WHERE `tipocis`.`id` = 32 ORDER BY tipo ASC LIMIT 1