app/controllers/contratos_controller.rb

  def edit
    @contrato = Contrato.find(params[:id])
    @tiposcontrato = Tipocontrato.all
---
SELECT `contratos`.* FROM `contratos` WHERE `contratos`.`id` = 2 ORDER BY codcontrato ASC LIMIT 1
SELECT `tipocontratos`.* FROM `tipocontratos` ORDER BY descricao ASC