app/controllers/dicdados_controller.rb

SELECT COUNT(*) FROM `dicdados`
SELECT `dicdados`.* FROM `dicdados` ORDER BY tipoci_id ASC, ordem ASC LIMIT 20 OFFSET 0
SELECT `tipocis`.* FROM `tipocis` ORDER BY tipo ASC
---
  def index

    @search = params[:search] || session[:search_dicdados]
    session[:search_dicdados] = @search


    begin
      @dicdados = Dicdado.search @search, :match_mode => :boolean, :per_page => 15 , :page => params[:page], :sort_mode => :extended, :order => "tipoci_id ASC, ordem ASC"
      @dicdados.compact!
    rescue
      flash[:error] = "Error[DB0001] - Search Engine desligado ou com problema"
      @dicdados = Dicdado.paginate(:page => params[:page])
 end

    @tipocis = Tipoci.all