app/controllers/eventos_controller.rb

SELECT `eventos`.* FROM `eventos`
---
  def index
    @eventos = Evento.all