app/controllers/notificacaos_controller.rb

  def index
    @notificacaos = Notificacao.all
---
SELECT `notificacaos`.* FROM `notificacaos`