app/controllers/relatorio_controller.rb

SELECT `cadrelatorios`.* FROM `cadrelatorios` WHERE `cadrelatorios`.`nome` = 'ServIP' LIMIT 1
---
  def index
    authorize!(:index, "relatorio")
    relatorio = Cadrelatorio.find_by_nome(params[:id])