app/controllers/statuscis_controller.rb

SELECT `statuscis`.* FROM `statuscis`
---
  def index
    @statuscis = Statusci.all