app/controllers/tasks_controller.rb

  def index

    @search_tasks = params[:search] || session[:search_tasks]
    session[:search_tasks] = @search

    puts "param: <#{@search_tasks}>"
    #puts "@search_tasks.to_json"

    if can? :manage, "tasks"
      if not (@search_tasks == "" or @search_tasks.nil? ) then
        puts "search: <#{@search_tasks}>"
        @tasks = Task.search @search_tasks, :match_mode => :boolean #, :per_page => 20, :page => params[:page]
---
SELECT `tasks`.* FROM `tasks` WHERE (Ativo=1 and publica=1) ORDER BY criticidade_id, created_at DESC

  def show
        @task = Task.find(params[:id])
---
SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`id` = 681 LIMIT 1

  def edit
    @task = Task.find(params[:id])
    @authors = Author.all
    @categories = Category.all
    @sites = Site.all
    @criticidades = Criticidade.all
---
SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`id` = 681 LIMIT 1
SELECT `authors`.* FROM `authors`
SELECT `categories`.* FROM `categories`
SELECT `sites`.* FROM `sites` ORDER BY nome ASC
SELECT `criticidades`.* FROM `criticidades`

  def update
    @task = Task.find(params[:id])
    respond_to do |format|
      if @task.update_attributes(params[:task])
---
SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`id` = 681 LIMIT 1
UPDATE `tasks` SET `comentario` = 'teste\r\n', `updated_at` = '2013-06-05 01:28:25' WHERE `tasks`.`id` = 681