app/controllers/tipocis_controller.rb

  def index
    @tipocis = Tipoci.all
---
SELECT `tipocis`.* FROM `tipocis` ORDER BY tipo ASC

  def show
    @tipoci = Tipoci.find(params[:id])
---
SELECT `tipocis`.* FROM `tipocis` WHERE `tipocis`.`id` = 9 ORDER BY tipo ASC LIMIT 1